let a = 12;
document.write(a) // перевірка, чи працює файл 

// 1) Оголосіть три різні змінні за допомогою "let", "const", "var"

let aa = 1;
var b = 2;
const c = 3;

// 2) Оголосіть одну змінну якій можна міняти значення і одну змінну якій не можна міняти значення
let aaa = 1; // можна міняти значення
var bbb = 2; // можна міняти значення
const ccc = 3; // не можна міняти значення

// 3) Напишіть 1 коментар в 1 рядок і напишіть ще один коментар на 4 рядки

// цей коментар на один рядочок
/* а цей коментар 
на декілька рядків
наприклад 
ось так*/

// 4) Оголосіть одну змінну і прийсвойте в неї будь яке значення типу String.
// * Bиведіть в консоль тип змінної виклристовуючи оператор "typeof" і функцію "console.log()"

let aaaa = 'adasd';
console.log(typeof aaaa);

// 5) Оголосіть одну змінну і прийсвойте в неї будь яке значення типу Number.
// * Bиведіть в консоль тип змінної виклристовуючи оператор "typeof" і функцію "console.log()"

let bbbb = 123123;
console.log(typeof bbbb);

// 6) Оголосіть одну змінну і прийсвойте в неї будь яке значення типу Boolean.
// * Bиведіть в консоль тип змінної виклристовуючи оператор "typeof" і функцію "console.log()"

let ab = false;
console.log(typeof ab);

// 7) Оголосіть одну змінну і прийсвойте в неї будь яке значення типу Object яке буде містити хоча б 3 ключі.
// * Bиведіть в консоль тип змінної виклристовуючи оператор "typeof" і функцію "console.log()"

let obj1 = {key1: '1', key2: '2', key3: '3'};
console.log(typeof obj1);

// 8) Оголосіть одну змінну і прийсвойте в неї будь яке значення типу Array яке буде містити хоча б 3 значення.
// * Bиведіть в консоль тип змінної виклристовуючи оператор "typeof" і функцію "console.log()"

let arr1 = [1, 2, 3];
console.log(typeof arr1);

// 9) Оголосіть одну змінну і прийсвойте в неї будь яке значення типу Function.
// * Bиведіть в консоль тип змінної виклристовуючи оператор "typeof" і функцію "console.log()"

function func(art) {  
	return (art);    //цю частину взяв з підручника
}

let m = 1;
func(m);

console.log(typeof m);

// 10) Оголосіть одну змінну і прийсвойте в неї будь яке значення типу Undefined.
// * Bиведіть в консоль тип змінної виклристовуючи оператор "typeof" і функцію "console.log()"

let un;
console.log(typeof un);

// 11) Оголосіть одну змінну і прийсвойте в неї будь яке значення типу Null.
// * Bиведіть в консоль тип змінної виклристовуючи оператор "typeof" і функцію "console.log()"

let nul = null;
console.log(typeof nul); 

// 12) Оголосіть змінну user типу Object і опишіть своє: ім'я, фамілію, дату народження,
// місце проживання, стать і можете добавити ще додаткові параметри використовуючи різні типи даних.

let user = {name: 'Alex', fam: 'YAkov', dateb: '4', place: 'Ukr', male: 'man', penis: true,}
console.log(user); 