// 1. Виведіть користувачу попап використовуючи функцію "alert" який містить довільне повідомлення.

alert('довільне повідомлення');

// 2. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"

let pr = prompt('Маешь муцора?');
console.log(pr);

// 3. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і має дефолтнe значення "13". Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"

let pr1 = prompt('Введіть 13', 13);
console.log(pr1);

// 4. Виведіть користувачу попап використовуючи функцію "confirm" який містить довільне питання. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"

let sd = confirm('Було введення?')
console.log(sd);

// 5. Виведіть користувачу попап використовуючи функцію "confirm" який містить довільне питання. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "if" виведіть в консоль "1" якщо відповідь на питання була позитивна

let sds = confirm('Маєшь автомобіль?');
    if (sds == true) {
        console.log('1');
    }; // else не прописував так як не було завдання при негативній відповіді, також хотів зробити через '?'
    console.log(sds);

// 6. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "if else" виведіть в консоль "1" або "2"

let pr2 = prompt('Маешь песика?');
if (pr2 == 'так') {
    console.log(1); 
} else {
    console.log(2);
}
console.log(pr2);

// або

let pr3 = prompt('Маешь песика?');
let tp = (pr3 == 'так') ? '1' : '2';
console.log(tp);

// 7. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "if else" виведіть в консоль "1" або "2" або "3"

let pr4 = prompt('Маешь мед?');
if (pr4 == 'так') {
    console.log(1); 
} else if (pr4 == 'ні') {
    console.log(2);
}
else {
    console.log(3);
}
console.log(pr4);

// 8. Виведіть користувачу попап використовуючи функцію "confirm" який містить довільне питання. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "switch" виведіть в консоль "1" якщо відповідь на питання була позитивна

let sd1 = confirm('Маєшь автомобіль?');
switch (sd1) {
    case true:
    console.log(1);    
        break;

    default:
        break;
}
console.log(sd1);

// 9. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "switch" виведіть в консоль "1" або "2"

let a = prompt('Маешь мед?');
switch (a) {
    case 'yes':
        console.log(1);
        break;

    default:
        console.log(2);
        break;
}

console.log(a);

// 10. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "switch" виведіть в консоль "1" або "2" або "3"

let a1 = prompt('Маешь мед?');
switch (a1) {
    case 'yes':
        console.log(1);
        break;
    case 'no':
        console.log(2);
        break;
    default:
        console.log(3);
        break;
}

console.log(a1);

// 11. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "switch" виведіть в консоль "1" або "2" або "3", виконайте те саме за допомогою "if else";
// *Зробіть два різні приклади

let a2 = prompt('Маешь мед?');
switch (a2) {
    case 'yes':
        console.log(1);
        break;
    case '':
        console.log(2);
        break;
    default:
        console.log(3);
        break;
}

let a3 = prompt('Маешь мед?');
    if (a3 == 'yes') {
        console.log(1);    
    } else if (a3 == 'no'){
        console.log(2);
    }
    else {
        console.log(3);
    }

console.log(a2, a3);