// 1. Використовуючи цикл "while" виведіть в консоль цифри від 0 до 10;
// * Зробіть те саме за допомогою циклу "do while" i "for"

let i = 0;
while (i <= 10) {
	console.log('while', i);
	i++;
}

i = 0;
do {
    console.log('do', i);
	i++; 
} while (i <= 10);


for(i = 0; i <= 10; i++) {
    console.log('for', i);
}
  
// 2. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {       // ТУТ ЗНАК '>' СТОЇТЬ НЕ В ТУ СТОРОНУ, Я ТАК РОЗУМІЮ, ЩО РЕЗУЛЬТАТ ЦИКЛУ НЕ МОЖЛИВИЙ АБО БЕЗКІНЕЧНІСТЬ ;)
//   console.log(i);      // ПЕРЕВІРИВ В БРАУЗЕРІ, НІЧОГО НЕ ВИДАЄ.
//   ++i;
// }




// 3. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// do {
//   console.log(i);
//   ++i;
// } while (i < 10)

    // 9

// 4. Замініть цей приклад використовуючи "while"
//
// for (let i = 0; i < 10; i++) {
//   console.log('i', i);
// }

i = 0;
while (i < 10) {
    console.log('i', i);
    i++
}

// 5. Яке перше значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {         // ТУТ ЗНАК '>' СТОЇТЬ НЕ В ТУ СТОРОНУ
//   ++i;
//   console.log(i);
// }

// 6. Яке перше значення буде виведено в консоль?
// let i = 1;
//
// do {
//   i++;
//   console.log(i);
// } while (i < 10)

// 1
// а коли перевірив, то видало 2. я думав, що тут має значення де стоять ++, до змінної чи після, але не врахував, що інкремент знаходиться до консол логу
// P.S. після того як браузер вида перший елемент 2 - я думаю: "ну і с якого хера ти з двійки почав?", потім дивлюсь код... і такий ладошкою по лбу.
