// 1. Створіть дві змінні типу стрінг і виведіть їх в консоль разом, використовуючи конкатинацію стрiнги.

let name2 = 'Cat';
let name1 = 'Dog';

console.log(`${name2}${name1}`);

// 2. Створіть змінну типу стрінг і виведіть в консоль її довжину.

name1 = 'Dog beteer then Cat';
console.log(name1.length);

// 3. Створіть змінну типу стрінг і виведіть в консоль перший символ стрінги.

console.log(name1.charAt(0));

// 4. Створіть змінну типу стрінг і виведіть в консоль останній символ, довільної стрінги.

console.log(name1.charAt(name1.length -1));

// 5. Створіть змінну типу стрінг і приведіть змінну до верхнього регістру.

name1 = name1.toUpperCase()

console.log(name1);

// 6. Створіть змінну типу стрінг і приведіть змінну до нижнього регістру.

name1 = name1.toLowerCase()

console.log(name1);

// 7. Створіть змінну і присвойте в неї дату вашого народження.

let birthDate = new Date('1994-05-04');
console.log(birthDate);

// 8. Виведіть рік вашого народження (Використовуючи змінну з 7 завдання).

console.log(birthDate.getFullYear());

// 9. Виведіть місяць вашого народження (Використовуючи змінну з 7 завдання).

console.log(birthDate.getMonth() +1);

// 10. Виведіть день вашого народження (Використовуючи змінну з 7 завдання).

console.log(birthDate.getDate());

// 11. Виведіть в консоль рік місяць день вашого народження через тире (-) (Використовуючи змінну з 7 завдання).

console.log(`${birthDate.getFullYear()}-${birthDate.getMonth() +1}-${(birthDate.getDate())}`);

// 12. Створіть нову дату яка має 14 годину і 23 хвилини.

let date3 = new Date(2022, 2, 28, 14, 23);
console.log(date3);

// 13. Порівняйте дві дати між собою і результат виведіть в консоль.

let dif = birthDate.getTime() - date3.getTime();
console.log(Math.round(dif / (1000 * 60 * 60 * 24))); // різниця в днях, округлив для більш приятного виду
